{"product_type_name": {"Underwear body": 1, "Bra": 2, "Sweater": 3, "Blouse": 4, "Trousers": 5, "Cardigan": 6, "Vest top": 7, "Skirt": 8, "T-shirt": 9, "Top": 10, "Belt": 11, "Socks": 12, "Boots": 13, "Other accessories": 14, "Underwear bottom": 15, "Hair/alice band": 16, "Dress": 17, "Pyjama jumpsuit/playsuit": 18, "Shirt": 19, "Pyjama set": 20, "Bag": 21, "Bracelet": 22, "Hair string": 23, "Underwear Tights": 24, "Jacket": 25, "Hair clip": 26, "Costumes": 27, "Hoodie": 28, "Scarf": 29, "Bodysuit": 30, "Other shoe": 31, "Polo shirt": 32, "Jumpsuit/Playsuit": 33, "Leggings/Tights": 34, "Coat": 35, "Pumps": 36, "Blazer": 37, "Earring": 38, "Swimsuit": 39, "Sleep Bag": 40, "Sneakers": 41, "Bikini top": 42, "Swimwear bottom": 43, "Sandals": 44, "Hat/beanie": 45, "Slippers": 46, "Flat shoe": 47, "Heeled sandals": 48, "Hat/brim": 49, "Fine cosmetics": 50, "Tailored Waistcoat": 51, "Necklace": 52, "Ring": 53, "Ballerinas": 54, "Wedge": 55, "Shorts": 56, "Watch": 57, "Gloves": 58, "Hair ties": 59, "Robe": 60, "Pyjama bottom": 61, "Outdoor Waistcoat": 62, "Sunglasses": 63, "Tie": 64, "Dungarees": 65, "Kids Underwear top": 66, "Cap/peaked": 67, "Underwear set": 68, "Unknown": 69, "Garment Set": 70, "Outdoor trousers": 71, "Flip flop": 72, "Swimwear set": 73, "Umbrella": 74, "Night gown": 75, "Soft Toys": 76, "Straw hat": 77, "Bootie": 78, "Bra extender": 79, "Swimwear top": 80, "Nipple covers": 81, "Waterbottle": 82, "Long John": 83, "Sarong": 84, "Underdress": 85, "Earrings": 86, "Hairband": 87, "Underwear corset": 88, "Outdoor overall": 89, "Leg warmers": 90, "Weekend/Gym bag": 91, "Alice band": 92, "Sleeping sack": 93, "Wallet": 94, "Braces": 95, "Chem. cosmetics": 96, "Cushion": 97, "Felt hat": 98, "Beanie": 99, "Blanket": 100, "Giftbox": 101}, "product_group_name": {"Underwear": 1, "Garment Upper body": 2, "Garment Lower body": 3, "Accessories": 4, "Socks & Tights": 5, "Shoes": 6, "Garment Full body": 7, "Nightwear": 8, "Swimwear": 9, "Underwear/nightwear": 10, "Cosmetic": 11, "Unknown": 12, "Items": 13, "Bags": 14, "Interior textile": 15}, "colour_group_name": {"Black": 1, "Light Pink": 2, "Pink": 3, "Dark Green": 4, "Dark Grey": 5, "Grey": 6, "Light Beige": 7, "Dark Red": 8, "Yellow": 9, "Turquoise": 10, "Red": 11, "White": 12, "Light Grey": 13, "Blue": 14, "Dark Blue": 15, "Dark Beige": 16, "Beige": 17, "Light Orange": 18, "Light Purple": 19, "Off White": 20, "Other Pink": 21, "Greenish Khaki": 22, "Dark Turquoise": 23, "Dark Pink": 24, "Greyish Beige": 25, "Light Blue": 26, "Orange": 27, "Other Red": 28, "Dark Yellow": 29, "Light Yellow": 30, "Light Turquoise": 31, "Green": 32, "Silver": 33, "Other Blue": 34, "Gold": 35, "Dark Purple": 36, "Other": 37, "Dark Orange": 38, "Yellowish Brown": 39, "Other Purple": 40, "Light Green": 41, "Other Orange": 42, "Other Green": 43, "Purple": 44, "Light Red": 45, "Transparent": 46, "Other Yellow": 47, "Unknown": 48, "Other Turquoise": 49, "Bronze/Copper": 50}, "department_name": {"Expressive Lingerie": 1, "Casual Lingerie": 2, "Tops Knitwear DS": 3, "Campaigns": 4, "Blouse": 5, "Trouser": 6, "Tops Knitwear": 7, "Basic 1": 8, "Skirts": 9, "Tops Fancy Jersey": 10, "Jersey": 11, "Projects Jersey & Knitwear": 12, "Jersey Fancy DS": 13, "Belts": 14, "Denim trousers": 15, "Shopbasket Socks": 16, "Kids Boy Knitwear": 17, "Baby Boy Woven": 18, "Baby Boy Jersey Fancy": 19, "Studio Collection": 20, "Girls Small Acc/Bags": 21, "Jersey fancy": 22, "Baby Nightwear": 23, "Jersey Basic": 24, "Woven bottoms": 25, "Ladies Sport Bottoms": 26, "Nightwear": 27, "Knitwear": 28, "Other Accessories": 29, "Small Accessories": 30, "Ladies Sport Bras": 31, "Jersey Fancy": 32, "Projects Dresses": 33, "Trousers": 34, "Skirt": 35, "Young Girl Knitwear": 36, "Kids Girl Jersey Fancy": 37, "Kids Girl Knitwear": 38, "Kids Girl S&T": 39, "Kids Boy Jersey Fancy": 40, "Denim Trousers": 41, "Outwear": 42, "Hair Accessories": 43, "Outdoor/Blazers": 44, "EQ & Special Collections": 45, "Bags": 46, "Scarves": 47, "Baby Girl Jersey Fancy": 48, "Heels": 49, "Young Girl Jersey Basic": 50, "Boots": 51, "Tights basic": 52, "Dresses": 53, "Knitwear Basic": 54, "Tops Woven": 55, "Premium Quality": 56, "Dress": 57, "Suit jacket": 58, "UW": 59, "Woven Occasion": 60, "Swimwear": 61, "Suit": 62, "Young Girl Denim": 63, "Kids Boy Outdoor": 64, "Clean Lingerie": 65, "Kids Boy Socks": 66, "Kids Boy Trouser": 67, "Kids Boy Denim": 68, "Divided Shoes": 69, "Sneakers": 70, "Flats": 71, "Loungewear": 72, "Jersey Occasion": 73, "Read & React": 74, "Baby Exclusive": 75, "Denim Other Garments": 76, "Everyday Waredrobe Denim": 77, "Gloves/Hats": 78, "Ladies Sport Acc": 79, "Jewellery": 80, "Baby Shoes": 81, "Woven top": 82, "Baby basics": 83, "Newborn": 84, "Knit & Woven": 85, "Baby Girl Knitwear": 86, "Baby Girl Woven": 87, "Baby Socks": 88, "Outdoor inactive from s1": 89, "Kids Girl Shoes": 90, "Jersey inactive from s1": 91, "Knitwear inactive from s1": 92, "Jacket Casual": 93, "Jacket Smart": 94, "Boys Local Relevance": 95, "Young Girl Jersey Fancy": 96, "Shoes / Boots inactive from s5": 97, "Socks Bin": 98, "Shirt": 99, "Underwear Jersey": 100, "Outdoor/Blazers DS": 101, "Dresses DS": 102, "Projects Woven Tops": 103, "Promotion/ Other /Offer": 104, "Basics": 105, "Shirt S&T": 106, "Shorts": 107, "Other items": 108, "Functional Lingerie": 109, "Divided+": 110, "Jewellery Extended": 111, "Blouse & Dress": 112, "OL Extended Sizes": 113, "Men Sport Tops": 114, "Small Bags": 115, "Take Care External": 116, "Woven Tops": 117, "Young Boy Big Acc": 118, "Young Boy Denim": 119, "Kids Girl Dresses": 120, "Equatorial Assortment": 121, "Trousers & Skirt": 122, "Young Girl Trouser": 123, "On Demand": 124, "Jacket Street": 125, "Woven inactive from s1": 126, "Young Girl UW/NW": 127, "Projects": 128, "Outwear & Blazers": 129, "Tops & Bottoms Other": 130, "Young Boy Jersey Fancy": 131, "Young Boy Shirt": 132, "Young Boy Outdoor": 133, "Kids Boy Shirt": 134, "Projects Woven Bottoms": 135, "Nursing": 136, "Divided Swimwear": 137, "Trousers DS": 138, "Young Girl Dresses": 139, "Light Basic Jersey": 140, "Young Boy Jersey Basic": 141, "Young Boy UW/NW": 142, "Kids Dress-up/Football": 143, "Kids Girl Outdoor": 144, "Young Boy Trouser": 145, "Young Boy Knitwear": 146, "Young Boy Socks": 147, "Bottoms Girls": 148, "AK Dresses & Outdoor": 149, "Tops Girls": 150, "Young Girl S&T": 151, "Young Girl Outdoor": 152, "Young Girl Big Acc": 153, "Sneakers big girl inactive from s2": 154, "Socks": 155, "Denim shorts": 156, "Kids Girl Jersey Basic": 157, "Heavy Basic Jersey": 158, "Sunglasses": 159, "Shorts & Skirts": 160, "Woven Premium": 161, "Kids Girl Denim": 162, "Kids Girl Trouser": 163, "Kids Girl Big Acc": 164, "Ladies Sport Woven": 165, "Accessories": 166, "Mama Lingerie": 167, "Kids Girl UW/NW": 168, "Shoes": 169, "Kids Boy Big Acc": 170, "Kids Boy UW/NW": 171, "Kids Girl Swimwear": 172, "Young Boy Shoes": 173, "Bottoms": 174, "Jersey/Knitwear Premium": 175, "Baby Boy Outdoor": 176, "Baby Boy Knitwear": 177, "Baby Toys/Acc": 178, "Divided+ inactive from s.1": 179, "Underwear Woven": 180, "Kids Boy Jersey Basic": 181, "Kids Boy Swimwear": 182, "Kids Boy Shoes": 183, "Tops woven DS": 184, "Young Girl Shoes": 185, "Girls Local Relevance": 186, "Girls Projects": 187, "Jersey License": 188, "Blazer": 189, "Trouser S&T": 190, "Baby Girl Outdoor": 191, "Skirts DS": 192, "Young Boy Shorts": 193, "Denim wardrobe H&M man inactive from S.6": 194, "Bags & Items": 195, "Promotion/Other/Offer": 196, "Dress-up Boys": 197, "Blazer S&T": 198, "Young boy Swimwear": 199, "Men Sport Woven": 200, "Special Collection": 201, "Limited Edition": 202, "Men Sport Acc": 203, "AK Tops Jersey & Woven": 204, "Local relevance": 205, "Shopbasket Lingerie": 206, "Sneakers small girl inactive from s2": 207, "Men Sport Bottoms": 208, "AK Bottoms": 209, "Young Girl Swimwear": 210, "Kids Boy License": 211, "Equatorial": 212, "Jackets": 213, "Jacket": 214, "Woven": 215, "Kids Boy Shorts": 216, "Small Acc. Jewellery & Other": 217, "Price Items": 218, "Socks Wall": 219, "EQ Divided Basics": 220, "EQ H&M Man": 221, "AK Other": 222, "License": 223, "Shorts DS": 224, "Conscious Exclusive": 225, "Promotion / Other / Offer": 226, "Test Ladies": 227, "Underwear Jersey Fancy inactive from s1": 228, "Jersey inactive from S.6": 229, "Woven bottoms inactive from S.7": 230}, "club_member_status": {"ACTIVE": 1, "NaN": 2, "PRE-CREATE": 3, "LEFT CLUB": 4}, "<DEFAULT_VALUE>": 0}
